<div style="background-color:darkgreen; text-align:center; font-color:white; vertical-align: middle; padding:10px;">
<font color="white" size = 5 >Functions and Grouping </font>
</div>

Functions
---------------------

#### Rentals Database
The rentals database include include the following tables:



Primary key of each relation is underlined.

**accommodations** (<u>id</u> , title, location, price, room, rating, type) 
> * id - accommodation id
> * title - accommodation title
> * location - accommodation location
> * price - accommodation price
> * rating - accommodation rating (by company)
> * type - accommodation type

> * **id is a primary key**

**ratings** (<u>userId</u>, <u>accoId</u>, rating)
> * userId - user id
> * accoId - accommodation id
> * rating - rating of an accommodation by user

>* **userId and accoId - primary key**

In [1]:
%load_ext sql
%sql sqlite:///rentals.db

--
 
**`%sql` is used for single line SQL commands:**  
**`%%sql` is used for multiple lines SQL commands:**

In [2]:
%%sql 

-- LIMIT restricts how many rows are displayed

SELECT * 
FROM accommodations
LIMIT 5;

 * sqlite:///rentals.db
Done.

[(1, 'Comfy Quiet Chalet', 'Vancouver', 50, 3, 3.1, 'cottage'),
 (2, 'Cozy Calm Hut', 'London', 65, 2, 4.1, 'cottage'),
 (3, 'Agreable Calm Place', 'London', 65, 4, 4.8, 'house'),
 (4, 'Colossal Quiet Chateau', 'Paris', 3400, 16, 2.7, 'castle'),
 (5, 'Homy Quiet Shack', 'Paris', 50, 1, 1.1, 'cottage')]

In [3]:
%%sql 
SELECT *  
FROM ratings
LIMIT 5;

 * sqlite:///rentals.db
Done.

[(10, 1, 1), (18, 1, 2), (13, 1, 1), (7, 2, 2), (4, 2, 2)]

<div style="background-color:darkblue; text-align:center; font-color:white; vertical-align: middle; padding:10px;">
<font color="white" size = 5 >Functions </font>
</div>

In [4]:
%%sql

-- Count the rows in the accommodations table

SELECT count(*)
FROM accommodations;

 * sqlite:///rentals.db
Done.

[(99,)]

In [5]:
%%sql

-- How many accommodations are in Paris?

SELECT count(*)
FROM accommodations
WHERE location = 'Paris';

 * sqlite:///rentals.db
Done.

[(9,)]

In [6]:
%%sql

-- How many castles have a rating over 3.0?
-- Display the result using column heading "# castles"

SELECT count(*) as "# castles"
FROM accommodations
WHERE type = 'castle' AND rating > 3;

 * sqlite:///rentals.db
Done.

[(14,)]

In [7]:
%%sql

-- Display rating min, max, avg, and sum 

SELECT min(rating) as "Rating Min", 
       max(rating) as "Max", 
       avg(rating) as "Avg",
       sum(rating) as "Sum"
FROM accommodations;

 * sqlite:///rentals.db
Done.

[(1.0, 4.9, 2.9686868686868686, 293.9)]

In [8]:
%%sql

-- The round function will restrict the number of digits after the decimal place.
-- round(7.456789, 2)  will produce 7.45.  
-- Use the round function to restrict the average to 2 digits after decimal place

SELECT min(rating) as "Rating Min", 
       max(rating) as "Max", 
       round(avg(rating),2) as "Avg",
       sum(rating) as "Sum"
FROM accommodations;

 * sqlite:///rentals.db
Done.

[(1.0, 4.9, 2.97, 293.9)]

<div style="background-color:darkblue; text-align:center; font-color:white; vertical-align: middle; padding:10px;">
<font color="white" size = 5 >GROUP BY </font>
</div>

In [9]:
%%sql

-- Display row count per type
-- This requires the GROUP BY clause


SELECT type, count(*) as "count"
FROM accommodations
GROUP BY type;

 * sqlite:///rentals.db
Done.

[('castle', 33), ('cottage', 28), ('house', 20), ('mansion', 18)]

In [10]:
%%sql

-- THIS IS INCORRECT!  Missing a GROUP BY clause.  
-- Displays the type found in last row along with the total row count

SELECT type, count(*) as "count"
FROM accommodations;

 * sqlite:///rentals.db
Done.

[('house', 99)]

In [11]:
%%sql

-- Display row count per type and location
-- GROUP BY must match non-function columns from SELECT clause

SELECT type, location, count(*) as "count"
FROM accommodations
GROUP BY type, location;

 * sqlite:///rentals.db
Done.

[('castle', 'Auckland', 1),
 ('castle', 'Berlin', 3),
 ('castle', 'Buenos Aires', 2),
 ('castle', 'London', 2),
 ('castle', 'Melbourne', 6),
 ('castle', 'NYC', 2),
 ('castle', 'Paris', 5),
 ('castle', 'San Francisco', 2),
 ('castle', 'Seattle', 5),
 ('castle', 'Tokyo', 2),
 ('castle', 'Vancouver', 3),
 ('cottage', 'Auckland', 3),
 ('cottage', 'Berlin', 1),
 ('cottage', 'Buenos Aires', 2),
 ('cottage', 'London', 3),
 ('cottage', 'Melbourne', 3),
 ('cottage', 'NYC', 3),
 ('cottage', 'Paris', 2),
 ('cottage', 'San Francisco', 6),
 ('cottage', 'Seattle', 4),
 ('cottage', 'Vancouver', 1),
 ('house', 'Auckland', 1),
 ('house', 'Berlin', 3),
 ('house', 'Dublin', 1),
 ('house', 'London', 3),
 ('house', 'Melbourne', 1),
 ('house', 'NYC', 3),
 ('house', 'Paris', 1),
 ('house', 'San Francisco', 1),
 ('house', 'Seattle', 2),
 ('house', 'Tokyo', 3),
 ('house', 'Vancouver', 1),
 ('mansion', 'Auckland', 2),
 ('mansion', 'Buenos Aires', 1),
 ('mansion', 'Dublin', 1),
 ('mansion', 'London', 2),
 ('mansion', 'Melbourne', 2),
 ('mansion', 'NYC', 1),
 ('mansion', 'Paris', 1),
 ('mansion', 'San Francisco', 3),
 ('mansion', 'Seattle', 3),
 ('mansion', 'Tokyo', 1),
 ('mansion', 'Vancouver', 1)]

In [12]:
%%sql

-- Display row count per type and location

SELECT location, type, count(*) as "count"
FROM accommodations
GROUP BY location, type;

 * sqlite:///rentals.db
Done.

[('Auckland', 'castle', 1),
 ('Auckland', 'cottage', 3),
 ('Auckland', 'house', 1),
 ('Auckland', 'mansion', 2),
 ('Berlin', 'castle', 3),
 ('Berlin', 'cottage', 1),
 ('Berlin', 'house', 3),
 ('Buenos Aires', 'castle', 2),
 ('Buenos Aires', 'cottage', 2),
 ('Buenos Aires', 'mansion', 1),
 ('Dublin', 'house', 1),
 ('Dublin', 'mansion', 1),
 ('London', 'castle', 2),
 ('London', 'cottage', 3),
 ('London', 'house', 3),
 ('London', 'mansion', 2),
 ('Melbourne', 'castle', 6),
 ('Melbourne', 'cottage', 3),
 ('Melbourne', 'house', 1),
 ('Melbourne', 'mansion', 2),
 ('NYC', 'castle', 2),
 ('NYC', 'cottage', 3),
 ('NYC', 'house', 3),
 ('NYC', 'mansion', 1),
 ('Paris', 'castle', 5),
 ('Paris', 'cottage', 2),
 ('Paris', 'house', 1),
 ('Paris', 'mansion', 1),
 ('San Francisco', 'castle', 2),
 ('San Francisco', 'cottage', 6),
 ('San Francisco', 'house', 1),
 ('San Francisco', 'mansion', 3),
 ('Seattle', 'castle', 5),
 ('Seattle', 'cottage', 4),
 ('Seattle', 'house', 2),
 ('Seattle', 'mansion', 3),
 ('Tokyo', 'castle', 2),
 ('Tokyo', 'house', 3),
 ('Tokyo', 'mansion', 1),
 ('Vancouver', 'castle', 3),
 ('Vancouver', 'cottage', 1),
 ('Vancouver', 'house', 1),
 ('Vancouver', 'mansion', 1)]

In [13]:
%%sql

-- Display average price per location. Sort results by average price

SELECT location, avg(price) as "average price"
FROM accommodations
GROUP BY location
ORDER BY avg(price);

 * sqlite:///rentals.db
Done.

[('London', 494.5),
 ('Dublin', 592.5),
 ('Auckland', 657.1428571428571),
 ('San Francisco', 667.0833333333334),
 ('Tokyo', 699.1666666666666),
 ('NYC', 885.5555555555555),
 ('Buenos Aires', 911.0),
 ('Berlin', 1032.857142857143),
 ('Seattle', 1216.0714285714287),
 ('Melbourne', 1505.4166666666667),
 ('Paris', 1583.3333333333333),
 ('Vancouver', 1625.0)]

In [14]:
%%sql

-- Same query, round average price to whole dollars

SELECT location, round(avg(price)) as "average price"
FROM accommodations
GROUP BY location
ORDER BY "average price";

 * sqlite:///rentals.db
Done.

[('London', 495.0),
 ('Dublin', 593.0),
 ('Auckland', 657.0),
 ('San Francisco', 667.0),
 ('Tokyo', 699.0),
 ('NYC', 886.0),
 ('Buenos Aires', 911.0),
 ('Berlin', 1033.0),
 ('Seattle', 1216.0),
 ('Melbourne', 1505.0),
 ('Paris', 1583.0),
 ('Vancouver', 1625.0)]

<div style="background-color:darkblue; text-align:center; font-color:white; vertical-align: middle; padding:10px;">
<font color="white" size = 5 >HAVING - SFWGHO </font>
</div>

In [15]:
%%sql

-- Display location and counts above 10
-- Use HAVING clause to restrict result based on function

SELECT location, count(*)
FROM accommodations
GROUP BY location
HAVING count(*) > 10;

 * sqlite:///rentals.db
Done.

[('Melbourne', 12), ('San Francisco', 12), ('Seattle', 14)]

In [16]:
%%sql

-- INCORRECT!! Use HAVING to test function value
-- Using a multi-line comment 
/*
SELECT location, count(*)
FROM accommodations
WHERE count(*) > 10
GROUP BY location;
*/

 * sqlite:///rentals.db
0 rows affected.

[]

In [17]:
%%sql

-- Display location, avg, min and max rating for castles. 
-- Restrict the results to locations with average rating above 3.5.
-- Sort in descending order of average rating

SELECT location, avg(rating), min(rating), max(rating)
FROM accommodations
WHERE type = 'castle'
GROUP BY location
HAVING avg(rating) > 3.5
ORDER BY avg(rating) desc;

 * sqlite:///rentals.db
Done.

[('Buenos Aires', 3.9, 3.3, 4.5),
 ('San Francisco', 3.9, 3.7, 4.1),
 ('Vancouver', 3.6999999999999997, 3.2, 4.0)]

In [18]:
%%sql

-- Assume you only have $40.  Which locations can you visit?
-- Show minimum price for each location, label the resulting column "cheapest".  
-- Do not show location with a min price above $40.

SELECT location, min(price) as cheapest
FROM accommodations
GROUP BY location
HAVING cheapest <= 40;

 * sqlite:///rentals.db
Done.

[('Berlin', 30),
 ('Buenos Aires', 40),
 ('Dublin', 35),
 ('San Francisco', 40),
 ('Seattle', 35),
 ('Tokyo', 30)]